<?php
/**
 * Created by PhpStorm.
 * User: millik
 * Date: 2019/2/22
 * Time: 11:02
 */
// +----------------------------------------------------------------------
// | 使用org/Auth 授权  不带前缀
// +----------------------------------------------------------------------
return [
    'auth_on'           => 1, // 权限开关
    'auth_type'         => 1, // 认证方式，1为实时认证；2为登录认证。
    'auth_group'        => 'auth_group', // 用户组数据表名 信息不带前缀表
    'auth_group_access' => 'auth_group_access', // 用户-用户组关系表 信息不带前缀表
    'auth_rule'         => 'auth_rule', // 权限规则表 信息不带前缀表
    'auth_user'         => 'user', // 用户信息表 信息不带前缀表
];